app/views/carts/show.html.erb

                    <tbody>
                    <% @cart.line_items.each do |p| %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 2]]