app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 2], ["created_at", "2020-11-24 17:12:25.468763"], ["updated_at", "2020-11-24 17:12:25.468763"]]
INSERT INTO "line_items" ("cart_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cart_id", 2], ["product_id", 1], ["created_at", "2020-11-24 17:12:25.526099"], ["updated_at", "2020-11-24 17:12:25.526099"]]
UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 2], ["updated_at", "2020-11-24 17:59:23.116641"], ["id", 3]]
---
    def create
        product = Product.find(params[:product_id])
        @line_item = @cart.add_product(product)

        if @line_item.save

SELECT  "line_items".* FROM "line_items" WHERE "line_items"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "line_items" WHERE "line_items"."id" = $1  [["id", 3]]
---
    def destroy
        @line_item = LineItem.find(params[:id])
        @line_item.destroy