app/controllers/concerns/current_cart.rb

    def set_cart
        @cart = Cart.find_or_create_by(user_id: current_user.id)
---
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 2], ["created_at", "2020-11-24 17:12:25.468763"], ["updated_at", "2020-11-24 17:12:25.468763"]]
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]